Documents/ЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗаказПоставщику</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаемаяДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусЗаказаПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаДоговора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериалов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Материал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаказПоставщику/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Процедура выполняется на сервере при создании формы.
// Здесь сразу скрываем Кассу и Банковский счет еще до показа формы пользователю.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Элементы.Касса.Видимость = Ложь;
	Элементы.БанковскийСчет.Видимость = Ложь;

КонецПроцедуры


// Процедура выполняется на клиенте при открытии формы.
// Дополнительно скрываем/показываем поля оплаты при открытии.
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УправлениеВидимостьюОплаты();

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда в табличной части "Материалы" изменили материал.
&НаКлиенте
Процедура МатериалыМатериалПриИзменении(Элемент)

	ПересчитатьСтрокуМатериалов();
	
КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда в строке табличной части изменили вид цены.
&НаКлиенте
Процедура МатериалыВидЦеныПриИзменении(Элемент)

	ПересчитатьСтрокуМатериалов();
	
КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь изменил количество материала.
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)

	Стр = Элементы.Материалы.ТекущиеДанные;
	
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Стр.Стоимость = Стр.Количество * Стр.ЦенаДоговора;
	
	ПересчитатьСумму();

КонецПроцедуры


// Процедура выполняется на клиенте.
// Она срабатывает, когда пользователь вручную изменил цену договора.
&НаКлиенте
Процедура МатериалыЦенаДоговораПриИзменении(Элемент)

	Стр = Элементы.Материалы.ТекущиеДанные;
	
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Стр.Стоимость = Стр.Количество * Стр.ЦенаДоговора;
	
	ПересчитатьСумму();

КонецПроцедуры


// Процедура срабатывает при изменении способа оплаты.
// Сначала скрывает оба поля, потом показывает только нужное.
&НаКлиенте
Процедура СпособОплатыПриИзменении(Элемент)

	УправлениеВидимостьюОплаты();

КонецПроцедуры


// Главная процедура управления видимостью полей оплаты.
&НаКлиенте
Процедура УправлениеВидимостьюОплаты()

	// Сначала всегда скрываем оба поля.
	Элементы.Касса.Видимость = Ложь;
	Элементы.БанковскийСчет.Видимость = Ложь;

	// Если способ оплаты не выбран — оба поля остаются скрытыми.
	Если Не ЗначениеЗаполнено(Объект.СпособОплаты) Тогда
		Объект.Касса = Неопределено;
		Объект.БанковскийСчет = Неопределено;
		Возврат;
	КонецЕсли;

	// Наличная оплата — показываем только кассу.
	Если Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Наличная") Тогда
		
		Элементы.Касса.Видимость = Истина;
		Элементы.БанковскийСчет.Видимость = Ложь;
		
		Объект.БанковскийСчет = Неопределено;

	// Безналичная оплата — показываем только банковский счет.
	ИначеЕсли Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Безналичная") Тогда
		
		Элементы.Касса.Видимость = Ложь;
		Элементы.БанковскийСчет.Видимость = Истина;
		
		Объект.Касса = Неопределено;

	// Онлайн-оплата — тоже показываем только банковский счет.
	ИначеЕсли Объект.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособОплаты.Онлайн") Тогда
		
		Элементы.Касса.Видимость = Ложь;
		Элементы.БанковскийСчет.Видимость = Истина;
		
		Объект.Касса = Неопределено;

	Иначе
		
		Элементы.Касса.Видимость = Ложь;
		Элементы.БанковскийСчет.Видимость = Ложь;
		
		Объект.Касса = Неопределено;
		Объект.БанковскийСчет = Неопределено;

	КонецЕсли;

КонецПроцедуры


// Процедура пересчитывает текущую строку табличной части "Материалы".
&НаКлиенте
Процедура ПересчитатьСтрокуМатериалов()

	Стр = Элементы.Материалы.ТекущиеДанные;
	
	Если Стр = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Стр.Материал)
		И ЗначениеЗаполнено(Стр.ВидЦены) Тогда
		
		Стр.ЦенаДоговора = ПолучитьЦенуМатериала(
			Стр.Материал,
			Стр.ВидЦены,
			Объект.Дата);
			
	Иначе
		
		Стр.ЦенаДоговора = 0;
		
	КонецЕсли;

	Стр.Стоимость = Стр.Количество * Стр.ЦенаДоговора;
	
	ПересчитатьСумму();

КонецПроцедуры


// Процедура пересчитывает общую сумму документа.
&НаКлиенте
Процедура ПересчитатьСумму()

	Итог = 0;

	Для Каждого Стр Из Объект.Материалы Цикл
		
		Итог = Итог + Стр.Стоимость;
		
	КонецЦикла;

	Объект.ОбщаяСумма = Итог;

КонецПроцедуры


// Функция получает цену материала из регистра сведений "ЦеныМатериалов".
&НаСервереБезКонтекста
Функция ПолучитьЦенуМатериала(Материал, ВидЦены, ДатаДок)

	Если Не ЗначениеЗаполнено(Материал) Или Не ЗначениеЗаполнено(ВидЦены) Тогда
		Возврат 0;
	КонецЕсли;

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныМатериаловСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныМатериалов.СрезПоследних(
	|		&Дата,
	|		Материал = &Материал
	|		И ВидЦены = &ВидЦены
	|	) КАК ЦеныМатериаловСрезПоследних";

	Запрос.УстановитьПараметр("Дата", КонецДня(ДатаДок));
	Запрос.УстановитьПараметр("Материал", Материал);
	Запрос.УстановитьПараметр("ВидЦены", ВидЦены);

	Рез = Запрос.Выполнить();

	Если Не Рез.Пустой() Тогда
		
		Выб = Рез.Выбрать();
		
		Если Выб.Следующий() Тогда
			Возврат Выб.Цена;
		КонецЕсли;
		
	КонецЕсли;

	Возврат 0;

КонецФункции
